In [1]:
import pandas as pd
import numpy as np

<b style="font-size:40px;color:#f51010">Creating a DataFrame using numpy and pandas</b>

<h3>Columns</h3>
<ul>
<li>
Name
</li>
<li>
Gender
</li>
<li>
Subject
</li>
<li>
Department
</li>
<li>
Mark
</li>

In [12]:
#Creating a array 'name' for the df
n=np.array(["S{0}".format(i) for i in range(1,101)])

In [13]:
#Viewing the values present in N
n

array(['S1', 'S2', 'S3', 'S4', 'S5', 'S6', 'S7', 'S8', 'S9', 'S10', 'S11',
       'S12', 'S13', 'S14', 'S15', 'S16', 'S17', 'S18', 'S19', 'S20',
       'S21', 'S22', 'S23', 'S24', 'S25', 'S26', 'S27', 'S28', 'S29',
       'S30', 'S31', 'S32', 'S33', 'S34', 'S35', 'S36', 'S37', 'S38',
       'S39', 'S40', 'S41', 'S42', 'S43', 'S44', 'S45', 'S46', 'S47',
       'S48', 'S49', 'S50', 'S51', 'S52', 'S53', 'S54', 'S55', 'S56',
       'S57', 'S58', 'S59', 'S60', 'S61', 'S62', 'S63', 'S64', 'S65',
       'S66', 'S67', 'S68', 'S69', 'S70', 'S71', 'S72', 'S73', 'S74',
       'S75', 'S76', 'S77', 'S78', 'S79', 'S80', 'S81', 'S82', 'S83',
       'S84', 'S85', 'S86', 'S87', 'S88', 'S89', 'S90', 'S91', 'S92',
       'S93', 'S94', 'S95', 'S96', 'S97', 'S98', 'S99', 'S100'],
      dtype='<U4')

In [15]:
#Duplicating the values 
n=np.repeat(n,3)

In [16]:
#Viewing the updated values present in N
n

array(['S1', 'S1', 'S1', 'S2', 'S2', 'S2', 'S3', 'S3', 'S3', 'S4', 'S4',
       'S4', 'S5', 'S5', 'S5', 'S6', 'S6', 'S6', 'S7', 'S7', 'S7', 'S8',
       'S8', 'S8', 'S9', 'S9', 'S9', 'S10', 'S10', 'S10', 'S11', 'S11',
       'S11', 'S12', 'S12', 'S12', 'S13', 'S13', 'S13', 'S14', 'S14',
       'S14', 'S15', 'S15', 'S15', 'S16', 'S16', 'S16', 'S17', 'S17',
       'S17', 'S18', 'S18', 'S18', 'S19', 'S19', 'S19', 'S20', 'S20',
       'S20', 'S21', 'S21', 'S21', 'S22', 'S22', 'S22', 'S23', 'S23',
       'S23', 'S24', 'S24', 'S24', 'S25', 'S25', 'S25', 'S26', 'S26',
       'S26', 'S27', 'S27', 'S27', 'S28', 'S28', 'S28', 'S29', 'S29',
       'S29', 'S30', 'S30', 'S30', 'S31', 'S31', 'S31', 'S32', 'S32',
       'S32', 'S33', 'S33', 'S33', 'S34', 'S34', 'S34', 'S35', 'S35',
       'S35', 'S36', 'S36', 'S36', 'S37', 'S37', 'S37', 'S38', 'S38',
       'S38', 'S39', 'S39', 'S39', 'S40', 'S40', 'S40', 'S41', 'S41',
       'S41', 'S42', 'S42', 'S42', 'S43', 'S43', 'S43', 'S44', 'S44',
       'S44', 'S45', 'S45', 'S45', 'S46', 'S46', 'S46', 'S47', 'S47',
       'S47', 'S48', 'S48', 'S48', 'S49', 'S49', 'S49', 'S50', 'S50',
       'S50', 'S51', 'S51', 'S51', 'S52', 'S52', 'S52', 'S53', 'S53',
       'S53', 'S54', 'S54', 'S54', 'S55', 'S55', 'S55', 'S56', 'S56',
       'S56', 'S57', 'S57', 'S57', 'S58', 'S58', 'S58', 'S59', 'S59',
       'S59', 'S60', 'S60', 'S60', 'S61', 'S61', 'S61', 'S62', 'S62',
       'S62', 'S63', 'S63', 'S63', 'S64', 'S64', 'S64', 'S65', 'S65',
       'S65', 'S66', 'S66', 'S66', 'S67', 'S67', 'S67', 'S68', 'S68',
       'S68', 'S69', 'S69', 'S69', 'S70', 'S70', 'S70', 'S71', 'S71',
       'S71', 'S72', 'S72', 'S72', 'S73', 'S73', 'S73', 'S74', 'S74',
       'S74', 'S75', 'S75', 'S75', 'S76', 'S76', 'S76', 'S77', 'S77',
       'S77', 'S78', 'S78', 'S78', 'S79', 'S79', 'S79', 'S80', 'S80',
       'S80', 'S81', 'S81', 'S81', 'S82', 'S82', 'S82', 'S83', 'S83',
       'S83', 'S84', 'S84', 'S84', 'S85', 'S85', 'S85', 'S86', 'S86',
       'S86', 'S87', 'S87', 'S87', 'S88', 'S88', 'S88', 'S89', 'S89',
       'S89', 'S90', 'S90', 'S90', 'S91', 'S91', 'S91', 'S92', 'S92',
       'S92', 'S93', 'S93', 'S93', 'S94', 'S94', 'S94', 'S95', 'S95',
       'S95', 'S96', 'S96', 'S96', 'S97', 'S97', 'S97', 'S98', 'S98',
       'S98', 'S99', 'S99', 'S99', 'S100', 'S100', 'S100'], dtype='<U4')

In [17]:
#DataFrame Creation
student_details=pd.DataFrame()

In [18]:
#Inserting the name column
student_details['Name']=n

In [19]:
#Viewing the dataframe
student_details

     Name
0      S1
1      S1
2      S1
3      S2
4      S2
..    ...
295   S99
296   S99
297  S100
298  S100
299  S100

[300 rows x 1 columns]

In [20]:
# creating a column 'gender'
g = np.random.choice(['M','F'],100)

In [21]:
#Viewing the values present in it
g

array(['F', 'M', 'M', 'M', 'M', 'F', 'M', 'F', 'M', 'F', 'M', 'M', 'M',
       'F', 'M', 'M', 'F', 'M', 'F', 'F', 'F', 'M', 'F', 'F', 'M', 'F',
       'F', 'M', 'M', 'M', 'M', 'M', 'M', 'F', 'M', 'F', 'M', 'M', 'F',
       'F', 'F', 'F', 'F', 'M', 'F', 'F', 'M', 'F', 'M', 'M', 'M', 'M',
       'F', 'M', 'F', 'F', 'M', 'M', 'F', 'M', 'F', 'F', 'M', 'F', 'F',
       'M', 'F', 'M', 'M', 'M', 'F', 'M', 'M', 'F', 'F', 'M', 'F', 'F',
       'F', 'M', 'F', 'M', 'M', 'M', 'F', 'F', 'M', 'F', 'F', 'F', 'M',
       'M', 'F', 'M', 'F', 'F', 'F', 'F', 'M', 'F'], dtype='<U1')

In [22]:
#Duplicating the Values
g=np.repeat(g,3)

In [23]:
#Viewing the updated values present in it
g

array(['F', 'F', 'F', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M',
       'M', 'M', 'F', 'F', 'F', 'M', 'M', 'M', 'F', 'F', 'F', 'M', 'M',
       'M', 'F', 'F', 'F', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M',
       'F', 'F', 'F', 'M', 'M', 'M', 'M', 'M', 'M', 'F', 'F', 'F', 'M',
       'M', 'M', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'M', 'M',
       'M', 'F', 'F', 'F', 'F', 'F', 'F', 'M', 'M', 'M', 'F', 'F', 'F',
       'F', 'F', 'F', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M',
       'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'F', 'F', 'F', 'M', 'M',
       'M', 'F', 'F', 'F', 'M', 'M', 'M', 'M', 'M', 'M', 'F', 'F', 'F',
       'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'M',
       'M', 'M', 'F', 'F', 'F', 'F', 'F', 'F', 'M', 'M', 'M', 'F', 'F',
       'F', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M',
       'F', 'F', 'F', 'M', 'M', 'M', 'F', 'F', 'F', 'F', 'F', 'F', 'M',
       'M', 'M', 'M', 'M', 'M', 'F', 'F', 'F', 'M', 'M', 'M', 'F', 'F',
       'F', 'F', 'F', 'F', 'M', 'M', 'M', 'F', 'F', 'F', 'F', 'F', 'F',
       'M', 'M', 'M', 'F', 'F', 'F', 'M', 'M', 'M', 'M', 'M', 'M', 'M',
       'M', 'M', 'F', 'F', 'F', 'M', 'M', 'M', 'M', 'M', 'M', 'F', 'F',
       'F', 'F', 'F', 'F', 'M', 'M', 'M', 'F', 'F', 'F', 'F', 'F', 'F',
       'F', 'F', 'F', 'M', 'M', 'M', 'F', 'F', 'F', 'M', 'M', 'M', 'M',
       'M', 'M', 'M', 'M', 'M', 'F', 'F', 'F', 'F', 'F', 'F', 'M', 'M',
       'M', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'M', 'M', 'M',
       'M', 'M', 'M', 'F', 'F', 'F', 'M', 'M', 'M', 'F', 'F', 'F', 'F',
       'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'M', 'M', 'M', 'F', 'F',
       'F'], dtype='<U1')

In [24]:
#Inserting it into the Dataframe
student_details['Gender']=g

In [25]:
#Viewing the Dataframe
student_details

     Name Gender
0      S1      F
1      S1      F
2      S1      F
3      S2      M
4      S2      M
..    ...    ...
295   S99      M
296   S99      M
297  S100      F
298  S100      F
299  S100      F

[300 rows x 2 columns]

In [32]:
#Creating a column 'Subject'
s=np.array([['Python','C','Java'] for i in range(100)])

In [33]:
#Viewing the values present in it
s

array([['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java'],
       ['Python', 'C', 'Java']], dtype='<U6')

In [35]:
#Flattening it to a 1d array
s.shape=(300,)

In [36]:
#Viewing the array with new dimension
s

array(['Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C',
       'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python',
       'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java',
       'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C',
       'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python',
       'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java',
       'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C',
       'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python',
       'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java',
       'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C',
       'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python',
       'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java',
       'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C',
       'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python',
       'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java',
       'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C',
       'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python',
       'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java',
       'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C',
       'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python',
       'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java',
       'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C',
       'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python',
       'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java',
       'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C',
       'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python',
       'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java',
       'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C',
       'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python',
       'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java',
       'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C',
       'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python',
       'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java',
       'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C',
       'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python',
       'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C', 'Java',
       'Python', 'C', 'Java', 'Python', 'C', 'Java', 'Python', 'C',
       'Java', 'Python', 'C', 'Java'], dtype='<U6')

In [37]:
#Inserting the column into the Dataframe
student_details['Subject']=s

In [38]:
#Viewing the Dataframe
student_details

     Name Gender Subject
0      S1      F  Python
1      S1      F       C
2      S1      F    Java
3      S2      M  Python
4      S2      M       C
..    ...    ...     ...
295   S99      M       C
296   S99      M    Java
297  S100      F  Python
298  S100      F       C
299  S100      F    Java

[300 rows x 3 columns]

In [39]:
# Creating a new Column 'Department'
d=np.random.choice(['AIML','AIDA','CYS','MED'],100)

In [41]:
#Duplicating Values 
d=np.repeat(d,3)

In [42]:
#Inserting into the Dataframe
student_details['Department']=d

In [43]:
#Viewing the Dataframe
student_details

     Name Gender Subject Department
0      S1      F  Python        MED
1      S1      F       C        MED
2      S1      F    Java        MED
3      S2      M  Python        CYS
4      S2      M       C        CYS
..    ...    ...     ...        ...
295   S99      M       C       AIDA
296   S99      M    Java       AIDA
297  S100      F  Python       AIDA
298  S100      F       C       AIDA
299  S100      F    Java       AIDA

[300 rows x 4 columns]

In [44]:
#Creating a new Column 'Marks'
m=np.random.randint(1,101,300)

In [45]:
#Inserting into the Dataframe
student_details['Marks']=m

In [46]:
#Viewing the Dataframe
student_details

     Name Gender Subject Department  Marks
0      S1      F  Python        MED     37
1      S1      F       C        MED     89
2      S1      F    Java        MED     60
3      S2      M  Python        CYS     74
4      S2      M       C        CYS     61
..    ...    ...     ...        ...    ...
295   S99      M       C       AIDA     54
296   S99      M    Java       AIDA     93
297  S100      F  Python       AIDA     65
298  S100      F       C       AIDA     76
299  S100      F    Java       AIDA     29

[300 rows x 5 columns]

<li>What is the total for each student</li>
<li>What is the avg mark for each student</li>
<li>What is the avg of each dept</li>
<li>What is the avg marks of python of each dept</li>
<li>What is the avg mark of java for each gender</li>

<b style="font-size:40px;color:#f51010">Using Groupby functions performing some basic operations</b>

In [57]:
q1= student_details.groupby(['Name'])['Marks'].sum()

In [58]:
q1

Name
S1      186
S10     256
S100    170
S11     270
S12     117
       ...
S95     228
S96     132
S97     190
S98     113
S99     186
Name: Marks, Length: 100, dtype: int32

In [59]:
q2= student_details.groupby(['Name'])['Marks'].mean()

In [60]:
q2

Name
S1      62.000000
S10     85.333333
S100    56.666667
S11     90.000000
S12     39.000000
          ...
S95     76.000000
S96     44.000000
S97     63.333333
S98     37.666667
S99     62.000000
Name: Marks, Length: 100, dtype: float64

In [61]:
q3= student_details.groupby(['Department'])['Marks'].mean()

In [62]:
q3

Department
AIDA    47.064103
AIML    55.615385
CYS     46.825397
MED     47.839506
Name: Marks, dtype: float64

In [63]:
q4= student_details.groupby(['Department','Subject'])['Marks'].mean()

In [64]:
q4

Department  Subject
AIDA        C          42.384615
            Java       53.923077
            Python     44.884615
AIML        C          55.538462
            Java       50.884615
            Python     60.423077
CYS         C          51.333333
            Java       43.761905
            Python     45.380952
MED         C          52.185185
            Java       50.777778
            Python     40.555556
Name: Marks, dtype: float64

In [67]:
q5=student_details.groupby(['Gender','Subject'])['Marks'].mean()

In [68]:
q5

Gender  Subject
F       C          52.34
        Java       50.58
        Python     48.52
M       C          48.32
        Java       49.72
        Python     47.20
Name: Marks, dtype: float64